app/controllers/plant_controller.rb

INSERT INTO "plants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Fir"], ["created_at", "2016-06-10 22:29:15.262059"], ["updated_at", "2016-06-10 22:29:15.262059"]]
---
  def identify
    #store input from plant name textbox into database
    #create local variable setting it equal to parameter from the textbox
    new_plant = params[:plant_name]
    #create instance variable to contain a plant object
    @plant = Plant.create!(name:new_plant)